Autodesk.Revit.DB.Structure.FabricRoundingManager.SegmentLengthRoundingMethod
Identifies the segment length rounding method
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2017

Autodesk.Revit.DB.Structure.FabricRoundingManager.SegmentLengthRounding
The rounding for fabric segments.
Remarks:
IsActiveOnElement property has to be true. SegmentLengthRounding is meaningless if IsActiveOnElement is false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for value is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The rounding value is not a positive value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2017

Autodesk.Revit.DB.Structure.FabricRoundingManager.TotalLengthRoundingMethod
Identifies the total length rounding method
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2016

Autodesk.Revit.DB.Structure.FabricRoundingManager.TotalLengthRounding
The rounding for Cut Overall Length and Cut Overall Width parameters.
Remarks:
IsActiveOnElement property has to be true. TotalLengthRounding is meaningless if IsActiveOnElement is false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for value is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The rounding value is not a positive value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2014